# FabricationSaveJobOptions Properties

---
The FabricationSaveJobOptions type exposes the following members.
| Name| Description
---|---|---
| AddHolesForTaps|  Set true to have holes for taps on straights added to the created fabrication job.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
FabricationSaveJobOptions Class
Autodesk.Revit.DB.Fabrication Namespace